app/script/nodoInviaRPT.sh.bak

#!/bin/bash
source $1
echo '<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ppt="http://ws.pagamenti.telematici.gov/ppthead" xmlns:ws="http://ws.pagamenti.telematici.gov/">
   <soapenv:Header>
      <ppt:intestazionePPT soapenv:actor="?" soapenv:mustUnderstand="?">
         <identificativoIntermediarioPA>'.$IDENTIFICATIVOINTERMEDIARIOPA.'</identificativoIntermediarioPA>
         <identificativoStazioneIntermediarioPA>'.$IDENTIFICATIVOSTAZIONEINTERMEDIARIOPA.'</identificativoStazioneIntermediarioPA>
         <identificativoDominio>'.$IDENTIFICATIVODOMINIO.'</identificativoDominio>
         <identificativoUnivocoVersamento>'.$IUV.'</identificativoUnivocoVersamento>
         <codiceContestoPagamento>'.$CCP.'</codiceContestoPagamento>
      </ppt:intestazionePPT>
   </soapenv:Header>
   <soapenv:Body>
      <ws:nodoInviaRPT>
         <password>'.$PASSWORD.'</password>
         <identificativoPSP>'.$IDENTIFICATIVOPSP.'</identificativoPSP>
         <!--Optional:-->
         <identificativoIntermediarioPSP>'.$IDENTIFICATIVOINTERMEDIARIOPSP.'</identificativoIntermediarioPSP>
         <!--Optional:-->
         <identificativoCanale>?</identificativoCanale>
         <tipoFirma>0</tipoFirma>' > nodoInviaRPTRequest.xml
echo '	 <rpt>'.$RPTENCODED.'</rpt>' >> nodoInviaRPTRequest.xml
echo '</ws:nodoInviaRPT>
   </soapenv:Body>
</soapenv:Envelope>'>> nodoInviaRPTRequest.xml

echo "Invio RPT al Nodo di Test Esterno";
curl -v -X POST --header "Content-Type: text/xml;charset=UTF-8" --header "SOAPAction:nodoInviaRPT" --data @nodoInviaRPTRequest.xml $URL
